In [12]:
import pandas as ps
df = {
    "Employee ID": [100, 101, 102, 103, 104, 105],
    "Name": ["Faiz", "Bhuvan", "Fahmin", "Tara", "Rahul", "Priya"],
    "Age": [19, 25, 28, 30, 20, 22],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Finance"],
    "Salary": [50000, 45000, 40000, 50000, 32000, 42000]
}

data = ps.DataFrame(df)
df

{'Employee ID': [100, 101, 102, 103, 104, 105],
 'Name': ['Faiz', 'Bhuvan', 'Fahmin', 'Tara', 'Rahul', 'Priya'],
 'Age': [19, 25, 28, 30, 20, 22],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'Finance'],
 'Salary': [50000, 45000, 40000, 50000, 32000, 42000]}

In [13]:
data.head()

   Employee ID    Name  Age Department  Salary
0          100    Faiz   19         HR   50000
1          101  Bhuvan   25         IT   45000
2          102  Fahmin   28    Finance   40000
3          103    Tara   30         IT   50000
4          104   Rahul   20         HR   32000

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  6 non-null      int64
 1   Name         6 non-null      object
 2   Age          6 non-null      int64
 3   Department   6 non-null      object
 4   Salary       6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 372.0+ bytes

In [15]:
data.describe()

       Employee ID        Age        Salary
count     6.000000   6.000000      6.000000
mean    102.500000  24.000000  43166.666667
std       1.870829   4.427189   6823.977335
min     100.000000  19.000000  32000.000000
25%     101.250000  20.500000  40500.000000
50%     102.500000  23.500000  43500.000000
75%     103.750000  27.250000  48750.000000
max     105.000000  30.000000  50000.000000

In [16]:
data.tail(2)

   Employee ID   Name  Age Department  Salary
4          104  Rahul   20         HR   32000
5          105  Priya   22    Finance   42000

In [17]:
data['expense']=data['Salary']*0.5

In [18]:
data

   Employee ID    Name  Age Department  Salary  expense
0          100    Faiz   19         HR   50000  25000.0
1          101  Bhuvan   25         IT   45000  22500.0
2          102  Fahmin   28    Finance   40000  20000.0
3          103    Tara   30         IT   50000  25000.0
4          104   Rahul   20         HR   32000  16000.0
5          105   Priya   22    Finance   42000  21000.0

In [21]:
data=data.drop(columns=['Salary','expense'])

In [22]:
data

   Employee ID    Name  Age Department
0          100    Faiz   19         HR
1          101  Bhuvan   25         IT
2          102  Fahmin   28    Finance
3          103    Tara   30         IT
4          104   Rahul   20         HR
5          105   Priya   22    Finance